Wall does not have both a curve driver and a curve!!!!
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WallLacksCurve { get; }
  Visual Basic
Public Shared ReadOnly Property WallLacksCurve As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WallLacksCurve {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace